import React from "react";
import { ContentStyled } from "./styled";

class Content extends React.PureComponent<any, any> {
  render() {
    return (
      <ContentStyled>
        <div
          dangerouslySetInnerHTML={{
            __html: this.props.html
          }}
        ></div>
        {/* <div>
        מאז שחרב בית-המקדש וגלו ישראל מארצם, לא פסקו מעם ישראל הזכרון והגעגועים לזמן שבו ישוב לארצו, ישוב ל"טבע יהדותו" האמיתי בקיום התורה והמצות במלואן, יחדש את חייו הלאומיים הממלכתיים, ויזכה להשראת שכינה בתוכם דרך בית המקדש שייבנה בקרוב.

אמנם, בדורות הרבים והארוכים של הגלות היה עיקר עיסוקם של חכמי ישראל במִצוֹתיו של היחיד, ובעבודת ה' – עבודת הנפש – של היחיד. מלבד אצל גדולים בודדים, כגון הרמב"ם, נזנח מאד העיסוק במִצוֹת הציבור ובפנימיותן, ונשארו הן בבחינת "הלכתא למשיחא" – כשיבוא המשיח הוא כבר ידע כיצד לטפל להתייחס ולפסוק בכל העניינים הללו.

עם פריחתן של הקבלה והחסידות, הופחה רוח חדשה בניצוץ של התקוה הממשית לגאולה ולמשיח. המשיח עצמו נתגלה למורנו הבעל_ שם_טוב זי"ע והתנה את ביאתו ב"יפוצו מעינותיך חוצה" (שהרי תורת החסידות היא ראשית ההתגלות וה"טעם" הטוב של תורתו של משיח). מאז, חיה בתודעתם של רוב היהודים הידיעה, כי לא יבוא העולם אל תיקונו, ואף תיקון האדם הפרטי לא יהא שלם, אלא כאשר תבוא הגאולה האמיתית והשלמה, יחזרו למקומם מלכות ישראל האמיתית ובית המקדש, ואף תנבע ותתגלה "תורה חדשה" – תורתו של משיח (כנאמר במדרש והודגש רבות בשיחותיו של הרבי מליובאוויטש). ממילא, נדרש מאתנו לעסוק ולברר גם את ה"הלכתא למשיחא", במגמה "להביא לימות המשיח".

בדורנו, שהוא דור בו כבר רואים ומרגישים כי החלו התקוות להתממש, וכי קרובה השעה בה הן יתממשו במלואן (כדבריו הברורים של הרבי מליובאוויטש), גוברת הדרישה להעמיק ולברר את השאיפות אליהן ראוי לנו לשאת פנינו, ואת מקורן במִצוֹת התורה ומשמעותן הפנימית המתגלה על-ידי חכמת פנימיות התורה.

ויתרה מזאת – דווקא בדור בו כבר זכינו לתחילת המימוש של שיבת עם ישראל לארצו והתישבותו בארץ, חשוב להדגיש את התקשרותנו ורצוננו במימוש תקוות כל הדורות, ולא לשקוע ב'הסתפקות במועט' שלילית המוותרת על שאיפותינו למלכות ישראל שלמה ואמיתית, להכרתת וביעור הרע מן העולם, ולבנין בית המקדש והשראת השכינה (שהן שלש מִצוֹת הציבור אותן מנו חז"ל: "להעמיד להם מלך, ולהכרית זרעו של עמלק, ולבנות להם בית הבחירה").

וכך דרשו חז"ל: "תני רבי שמעון בן יוחי... בשלשה דברים הן עתידין למאוס במלכות שמים ובמלכות בית דוד ובבנין בית המקדש... אמר רבי שמעון בן מנסיא אין ישראל רואין סימן ברכה לעולם עד שיחזרו ויבקשו שלשתן, הדא הוא דכתיב 'אחר ישובו בני ישראל ובִקשו את ה' אלהיהם', זו מלכות שמים, 'ואת דוד מלכם' זו מלכות בית דוד 'ופחדו אל ה' ואל טובו באחרית הימים' זה בנין בית המקדש" (מדרש שמואל, מהדורת בובר יג, ד).


        </div> */}
      </ContentStyled>
    );
  }
}

export default Content;
